package com.sgcc.pda.framelibrary.utils.check;

/**
 * Created by grx on 2019/6/16.
 * Description:错误码表
 */
public enum HZErrorCode {
    /**
     *  错误码+ 错误信息
     */
    Error_000000(000000, "正常！"),

    Error_020001(020001, "参数为空，请传入参数！"),
    Error_020002(020002, "参数格式有误，请校验传入参数格式！"),
    Error_020003(020003, "应用类型（appType）不能为空！"),
    Error_020004(020004, "工单号（orderNo）不能为空！"),
    Error_020005(020005, "计量设备通信规约类型（meterAgreement）不能为空！"),
    Error_020006(020006, "计量设备通信规约类型（meterAgreement）格式有误,正确格式如，01，02。"),
    Error_020007(020007, "任务类型（taskType）不能为空！"),
    Error_020008(20008, "任务类型（taskType）未知！"),

    Error_020009(20009, "任务数据（taskData）不能为空！"),
    Error_020010(20010, "任务数据（taskData）格式有误！"),

    Error_020011(20011, "电表地址（meterAddress）格式有误！"),
    Error_020012(20012, "客户编号（consNo）格式有误！"),
    Error_020013(20013, "充值金额（fillMoney）格式有误！"),
    Error_020014(20014, "充值金额（fillNum）格式有误！"),
    Error_020015(20015, "结算日格式有误,至少有一个不为空的结算日数据！"),
    Error_020016(20016, "第1结算日格式有误！"),
    Error_020017(20017, "第2结算日格式有误！"),
    Error_020018(20018, "第3结算日格式有误！"),

    Error_020019(20019, "终端逻辑地址（tmnlLAddr）格式有误！"),

    Error_020020(20020, "抄读数据集为空！"),
    Error_020021(20021, "抄读数据标识格式有误！"),
    Error_020022(20022, "抄读起始时间格式有误！"),
    Error_020023(20023, "抄读截止时间格式有误！"),
    Error_020024(20024, "抄读冻结数据时，截止时间最晚为当前时间的前一天！"),
    Error_020025(20025, "抄读冻结数据时，截止时间不能早于起始时间！"),
    Error_020026(20026, "抄读冻结数据时，截止时间与起始时间间隔不得超过60天！"),
    Error_020027(20027, "抄读当前数据时，截止时间与起始时间都应为当前时间！"),


    Error_020030(20030, "电价调整操作类型格式有误"),
    Error_020031(20031, "未知的电价调整操作类型"),
    Error_020032(20032, "电价调整操作数据（optData）为空！"),
    Error_020033(20033, "电价调整时费率数据格式有误！"),
    Error_020034(20034, "电价调整时费率电价值（price）格式有误！仅能精确到小数点后四位。"),
    Error_020035(20035, "电价调整时费率号（timeType）格式有误！正确格式如：01，02。"),
    Error_020036(20036, "电价调整时时段数据（timeBeg）格式有误！正确格式HHmm如0800，1230。"),
    Error_020037(20037, "电价调整时日时段表号（timeCode）格式有误！取值范围1-8。"),
    Error_020038(20038, "电价调整时切换时间格式有误！正确格式yyMMddHHmm。"),
    Error_020039(20039, "电价调整阶梯电价值格式有误！仅能精确到小数点后四位。"),
    Error_020040(20040, "电价调整阶梯结算日格式有误！正确格式MMddHH。"),
    Error_020041(20041, "电价调整阶梯值格式有误，仅能精确到小数点后两位。"),
    Error_020042(20042, "电价调整时区值格式有误,正确格式MMdd如：0301，0601。"),


    //充值开户
    ERROR_1001(1001, "查询电表充值信息失败！"),
    ERROR_1002(1002, "电能表未进行开户，无发进行远程充值！"),
    ERROR_1003(1003, "电能表内读取客户编号与主站档案不一致,无法进行充值！"),
    ERROR_1004(1004, "获取充值任务数据失败！"),
    ERROR_1005(1005, "充值次数异常！"),
    ERROR_1006(1006, "电能表充值失败！"),
    ERROR_1007(1007, "重复充值！"),

    Error_2101(2101, "读取当前运行时区、时段、阶梯以及费率信息失败！"),
    Error_2102(2102, "电价调整任务数据为空！"),
    Error_2103(2103, "获取充值任务数据失败！"),
    Error_2104(2104, "电价信息数据写入失败！"),
    Error_2105(2105, "时区时段调整失败！"),
    Error_2106(2106, "费率电价调整失败！"),
    Error_2107(2107, "时间调整失败！"),
    Error_2108(2108, "数量调整失败！"),
    Error_2109(2109, "电价调整成功，但是获取电价信息失败！"),
    Error_2110(2110, "电价调整失败！"),
    Error_2111(2111, "应用类型或工单号为空值！"),
    Error_2112(2112, "权限数据为空！"),
    Error_2113(2113, "权限数据已经失效，请重新下载权限数据！"),
    Error_2114(2114, "电价调整操作类型字段（optType）为空！"),
    Error_2115(2115, "若通信方式为串口，则电表类型不能为空！"),
    Error_2116(2116, "安全单元1.0，未查到注册信息！"),
    Error_2117(2117, "时区调整失败！"),
    Error_2118(2118, "时段调整失败！"),


    Error_2201(2201, "暂不支持13表最大需量清零！"),
    Error_2202(2202, "最大需量清零执行失败！"),
    Error_2203(2203, "1.0安全单元设备暂时无法对698电表进行最大需量清零操作！"),
    Error_2204(2204, "09表最大需量清零需要配合编程键，请按下编程键后重新执行！"),
    Error_2205(2205, "698电表执行最大需量清零，请求帧时间标签无效！请重新下载数据，建议在线执行！"),



    Error_010003(010003, "必要字段为空"),

    Error_010006(010006, "红外认证失败"),
    Error_010009( 10009, "身份认证失败"),
    Error_010012(010012, "密钥协商失败"),
    Error_010013(010013, "红外权限注册失败"),
    Error_010014(010014, "无红外权限数据"),
    Error_010015(010015, "无身份认证权限数据。"),
    Error_010016(010016, "从安全单元获取设参任务数据失败！"),
    Error_010017(010017, "权限注册失败！"),
    Error_010018(10018, "未知权限参数类型！"),

    Error_100001(100001, "安全单元版本判断失败！"),
    Error_100002(100002, "未对准电表或者电表通信地址与任务中地址不符！"),
    Error_100003(100003, "1.0安全单元设备暂时无法对698电表进行电价调整操作！"),
    Error_unknown(999999, "未知错误！"),

    ;
    int code;
    String errMessage;

    HZErrorCode(int code, String s) {
        this.code = code;
        this.errMessage = s;
    }

    public int getCode() {
        return code;
    }

    public String getErrMessage() {
        return errMessage;
    }

   /* public HZErrorCode setErrMessage(String errMessage) {
        this.errMessage = errMessage;
        return this;
    }*/

}
